tap "aws/tap"
tap "drone/drone"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "romkatv/powerlevel10k"
tap "siderolabs/talos"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws-sam-cli"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Network scanner
cask "angry-ip-scanner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organizer
cask "bartender"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# GUI app for Homebrew
cask "cakebrew"
# E-books management software
cask "calibre"
# Voice and text chat software
cask "discord"
# Draw.io is free online diagram software
cask "drawio"
# Utility for customizing which browser to start
cask "finicky"
# Game client
cask "gog-galaxy"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Open-source Markdown editor
cask "macdown"
# Visual diff and merge tool
cask "meld"
# Online collaborative whiteboard platform
cask "miro"
# GameStream client
cask "moonlight"
# HTTP client that helps testing and describing APIs
cask "paw"
# Home media player
cask "plex"
# Collaboration platform for API development
cask "postman"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Graphical client for Git version control
cask "sourcetree"
# A CLI for out-of-band management of Kubernetes nodes created by Talos
cask "talosctl"
# To-do list
cask "todoist"
# Free and open-source OpenVPN client
cask "tunnelblick"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Remote desktop application focusing on security
cask "vnc-viewer"
