eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-rename-tag
kamikillerto.vscode-colorize
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
rvest.vs-code-prettier-eslint
signageos.signageos-vscode-sops
signageos.signageos-vscode-sops-beta
vscode-icons-team.vscode-icons
yzhang.markdown-all-in-one
